# -*- coding: utf-8 -*-
"""
Created on Fri May 10 14:46:10 2024

@author: ksj
"""

import pandas as pd
# 데이터 불러오기
""" 통계청(KOSIS)
인구
    > 주민등록인구현황
        > 행정구역(읍면동)별/5세별 주민등록인구(2011년~) 
        - 경기도 모든 '시' / 수원시는 '구'까지
"""
df_2019 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_2019.xlsx', header=2)
df_2020 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_2020.xlsx', header=2)
df_2021 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_2021.xlsx', header=2)
df_2022 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_2022.xlsx', header=2)
df_2023 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_2023.xlsx', header=2)
df_2024 = pd.read_excel('./행정구역(읍면동)별5세별주민등록인구/행정구역_읍면동_별_5세별_주민등록인구_202404월.xlsx', header=2)

#%% 전처리 함수
def people_df(df) :
    # 컬럼명 변경
    df.columns = ['행정구역', '전체', '65 - 69세', '70 - 74세', '75 - 79세', '80 - 84세',
           '85 - 89세', '90 - 94세', '95 - 99세', '100+', '남자', '65 - 69세.1',
           '70 - 74세.1', '75 - 79세.1', '80 - 84세.1', '85 - 89세.1', '90 - 94세.1',
           '95 - 99세.1', '100+.1', '여자', '65 - 69세.2', '70 - 74세.2', '75 - 79세.2',
           '80 - 84세.2', '85 - 89세.2', '90 - 94세.2', '95 - 99세.2', '100+.2']
    
    # 65세 이상 합계 계산
    df['전체_65세이상'] = df.iloc[:, 2:10].sum(axis=1)
    df['남자_65세이상'] = df.iloc[:, 11:19].sum(axis=1)
    df['여자_65세이상'] = df.iloc[:, 21:28].sum(axis=1)

    # 총인구수 및 65세이상 인구수 값만 남기기
    df = df.loc[:, ['행정구역', '전체', '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상']]
    
    return df    

# 각 데이터 전처리
df_2019 = people_df(df_2019)
df_2020 = people_df(df_2020)
df_2021 = people_df(df_2021)
df_2022 = people_df(df_2022)
df_2023 = people_df(df_2023)
df_2024 = people_df(df_2024)

#%%
# 행정구역 공백 삭제
df_2019['행정구역'].unique()
"""
array(['경기도', '\u3000\u3000\u3000수원시',
       '\u3000\u3000\u3000\u3000\u3000\u3000장안구',
       '\u3000\u3000\u3000\u3000\u3000\u3000권선구',
       '\u3000\u3000\u3000\u3000\u3000\u3000팔달구',
       '\u3000\u3000\u3000\u3000\u3000\u3000영통구', '\u3000\u3000\u3000성남시',
       '\u3000\u3000\u3000의정부시', '\u3000\u3000\u3000안양시',
       '\u3000\u3000\u3000부천시', '\u3000\u3000\u3000광명시',
       '\u3000\u3000\u3000평택시', '\u3000\u3000\u3000동두천시',
       '\u3000\u3000\u3000안산시', '\u3000\u3000\u3000고양시',
       '\u3000\u3000\u3000과천시', '\u3000\u3000\u3000구리시',
       '\u3000\u3000\u3000남양주시', '\u3000\u3000\u3000오산시',
       '\u3000\u3000\u3000시흥시', '\u3000\u3000\u3000군포시',
       '\u3000\u3000\u3000의왕시', '\u3000\u3000\u3000하남시',
       '\u3000\u3000\u3000용인시', '\u3000\u3000\u3000파주시',
       '\u3000\u3000\u3000이천시', '\u3000\u3000\u3000안성시',
       '\u3000\u3000\u3000김포시', '\u3000\u3000\u3000화성시',
       '\u3000\u3000\u3000광주시', '\u3000\u3000\u3000양주시',
       '\u3000\u3000\u3000포천시', '\u3000\u3000\u3000여주시',
       '\u3000\u3000\u3000연천군', '\u3000\u3000\u3000가평군',
       '\u3000\u3000\u3000양평군'], dtype=object)
"""

df_2019['행정구역'] = df_2019['행정구역'].str.strip()
df_2019['행정구역'].unique()
"""
array(['경기도', '수원시', '장안구', '권선구', '팔달구', '영통구', '성남시', '의정부시', '안양시',
       '부천시', '광명시', '평택시', '동두천시', '안산시', '고양시', '과천시', '구리시', '남양주시',
       '오산시', '시흥시', '군포시', '의왕시', '하남시', '용인시', '파주시', '이천시', '안성시',
       '김포시', '화성시', '광주시', '양주시', '포천시', '여주시', '연천군', '가평군', '양평군'],
      dtype=object)
"""

df_2020['행정구역'] = df_2020['행정구역'].str.strip()
df_2021['행정구역'] = df_2021['행정구역'].str.strip()
df_2022['행정구역'] = df_2022['행정구역'].str.strip()
df_2023['행정구역'] = df_2023['행정구역'].str.strip()
df_2024['행정구역'] = df_2024['행정구역'].str.strip()

#%%
df_merge = pd.concat([df_2019, df_2020, df_2021, df_2022, df_2023, df_2024], axis=1)
df_merge.columns
"""
Index(['행정구역', '전체', '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상', '행정구역',
       '전체', '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상', '행정구역', '전체',
       '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상', '행정구역', '전체',
       '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상', '행정구역', '전체',
       '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상', '행정구역', '전체',
       '전체_65세이상', '남자', '남자_65세이상', '여자', '여자_65세이상'],
      dtype='object')
"""    

df_merge.columns = ['행정구역', '2019_전체', '2019_전체_65세이상', '2019_남자', '2019_남자_65세이상', '2019_여자', '2019_여자_65세이상', 'x',
       '2020_전체', '2020_전체_65세이상', '2020_남자', '2020_남자_65세이상', '2020_여자', '2020_여자_65세이상', 'x', '2021_전체',
       '2021_전체_65세이상', '2021_남자', '2021_남자_65세이상', '2021_여자', '2021_여자_65세이상', 'x', '2022_전체',
       '2022_전체_65세이상', '2022_남자', '2022_남자_65세이상', '2022_여자', '2022_여자_65세이상', 'x', '2023_전체',
       '2023_전체_65세이상', '2023_남자', '2023_남자_65세이상', '2023_여자', '2023_여자_65세이상', 'x', '2024_전체',
       '2024_전체_65세이상', '2024_남자', '2024_남자_65세이상', '2024_여자', '2024_여자_65세이상']

df_merge = df_merge[['행정구역', '2019_전체', '2019_전체_65세이상', '2019_남자', '2019_남자_65세이상', '2019_여자', '2019_여자_65세이상', 
                               '2020_전체', '2020_전체_65세이상', '2020_남자', '2020_남자_65세이상', '2020_여자', '2020_여자_65세이상', 
                               '2021_전체', '2021_전체_65세이상', '2021_남자', '2021_남자_65세이상', '2021_여자', '2021_여자_65세이상', 
                               '2022_전체', '2022_전체_65세이상', '2022_남자', '2022_남자_65세이상', '2022_여자', '2022_여자_65세이상', 
                               '2023_전체', '2023_전체_65세이상', '2023_남자', '2023_남자_65세이상', '2023_여자', '2023_여자_65세이상', 
                               '2024_전체', '2024_전체_65세이상', '2024_남자', '2024_남자_65세이상', '2024_여자', '2024_여자_65세이상']]

df_merge.to_csv('행정구역별_인구수_2019-202404.csv')
