# -*- coding: utf-8 -*-
"""
Created on Tue May  7 12:24:38 2024

@author: ksj
"""

import pandas as pd

df = pd.read_csv('./accidentInfoList_TAAS_경기도수원2023_전체.csv', low_memory=False, encoding='CP949')

#%%
# [사고일시] -> datetime
df['사고일시'] = pd.to_datetime(df['사고일시'], format='%Y년 %m월 %d일 %H시')  ## 2023-01-01 00:00:00
#   날짜(object)                   
df['날짜'] = df['사고일시'].dt.date                                            ## 2023-01-01
#   시간(int)
df['시간'] = df['사고일시'].dt.hour                                            ## 0

# [시군구] -> 구/ 동
gu = []
dong = []
for i in range(len(df)) :
    gu.append(df['시군구'].str.split(' ')[i][2])
    dong.append(df['시군구'].str.split(' ')[i][3])
df['구'] = gu 
df['동'] = dong

# [사고유형] '차대사람 - 기타' -> '차대사람', '기타'
dep1 = []
dep2 = []
for i in range(len(df)) :
    dep1.append(df['사고유형'].str.split(' - ')[i][0])
    dep2.append(df['사고유형'].str.split(' - ')[i][1])
df['사고유형1'] = dep1
df['사고유형2'] = dep2

# [도로형태] '단일로 - 기타' -> '단일로', '기타'
dep1 = []
dep2 = []
for i in range(len(df)) :
    dep1.append(df['도로형태'].str.split(' - ')[i][0])
    dep2.append(df['도로형태'].str.split(' - ')[i][1])
df['도로형태1'] = dep1
df['도로형태2'] = dep2

# [피해운전자] nan -> 0
""" df.iloc[:, 18:22].columns 
Index(['피해운전자 차종', '피해운전자 성별', '피해운전자 연령', '피해운전자 상해정도'], dtype='object')
"""
df.iloc[:, 18:22] = df.iloc[:, 18:22].fillna(0)

#%%
# [연령] 00세(object) -> 00(int)
# '가해운전자'
df['가해운전자 연령'].unique()
"""
array(['55세', '27세', '29세', '32세', '56세', '65세', '35세', '24세', '69세',
       '54세', '31세', '42세', '37세', '49세', '73세', '72세', '30세', '39세',
       '50세', '26세', '59세', '67세', '61세', '46세', '53세', '57세', '47세',
       '19세', '48세', '60세', '74세', '36세', '41세', '75세', '79세', '45세',
       '71세', '28세', '38세', '68세', '51세', '64세', '44세', '33세', '63세',
       '62세', '22세', '34세', '70세', '52세', '40세', '58세', '77세', '25세',
       '미분류', '23세', '17세', '21세', '43세', '66세', '76세', '80세', '18세',
       '84세', '15세', '16세', '20세', '81세', '87세', '78세', '83세', '13세',
       '14세', '82세', '88세', '10세', '85세', '12세', '11세', '9세'],
      dtype=object)
"""

df['가해운전자 연령'] = df['가해운전자 연령'].str[:-1]
# -> '미분류' : 0
df['가해운전자 연령'] = df['가해운전자 연령'].replace('미분', 0)

df['가해운전자 연령'] = df['가해운전자 연령'].astype('int64')

# '피해운전자'
df['피해운전자 연령'].unique()
"""
array(['29세', '14세', '51세', '42세', '39세', '49세', '27세', '22세', '68세',
       '38세', nan, '37세', '46세', '48세', '84세', '47세', '66세', '75세', '28세',
       '50세', '32세', '30세', '40세', '16세', '36세', '58세', '57세', '41세',
       '34세', '55세', '63세', '54세', '64세', '24세', '31세', '43세', '8세',
       '52세', '33세', '35세', '53세', '25세', '21세', '59세', '79세', '18세',
       '45세', '44세', '60세', '6세', '67세', '15세', '56세', '19세', '26세',
       '62세', '86세', '76세', '20세', '69세', '23세', '65세', '80세', '73세',
       '61세', '95세', '71세', '10세', '17세', '7세', '82세', '4세', '81세', '70세',
       '87세', '72세', '11세', '88세', '12세', '2세', '83세', '미분류', '78세',
       '13세', '74세', '77세', '9세', '85세', '5세', '90세', '3세', '91세', '89세',
       '93세', '98세 이상'], dtype=object)
"""

df['피해운전자 연령'] = df['피해운전자 연령'].str[:-1]
# -> '미분류' : 0
df['피해운전자 연령'] = df['피해운전자 연령'].replace('미분', 0)
# -> nan : 0
df['피해운전자 연령'] = df['피해운전자 연령'].fillna(0)
# -> '98세 이상' : 100
df['피해운전자 연령'] = df['피해운전자 연령'].replace('98세 이', 100)

df['피해운전자 연령'] = df['피해운전자 연령'].astype('int64')
